In [1]:
# Installation of pandas
!pip install pandas

Requirement already satisfied: pandas in d:\data\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in d:\data\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\data\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\data\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\data\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in d:\data\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
# Importing the pandas
import pandas as pd

## Pandas Data Structures
- Series (1D) - it is a 1 Dimensional Labbeled array
- DataFrame (2D) - A 2 Dimensional Table
- https://pandas.pydata.org/docs/

In [3]:
# Series
data = [10, 20, 30, 40]
series1 = pd.Series(data)

In [4]:
print(series1)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
type(data)

list

In [7]:
# specify the index
series = pd.Series(data, index =["a", "b", "c", "d"])
print(series)

a    10
b    20
c    30
d    40
dtype: int64

In [35]:
# DataFrame
data = {
    "Name" : ['Alice', "Bob", "Charlie", "Don"],
    "Age" : [24, 30, 26, 18],
    "Salary" : [5000, 4000, 6000, 7000]
}

In [36]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'Don'],
 'Age': [24, 30, 26, 18],
 'Salary': [5000, 4000, 6000, 7000]}

In [37]:
# Dataframe
df1 = pd.DataFrame(data)
print(df1)

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

# Reading and writing data
- read, write multiple file formats

In [11]:
# Reading CSV Files
csv_data = pd.read_csv("C:/Users/Admin/Desktop/Omdena/Tanzania_CBWP_KIC/Week 5/Resources/movies.csv")
# path = "C:\Users\Admin\Desktop\Omdena\Tanzania_CBWP_KIC\Week 5\Resources\movies.csv"

In [12]:
print(csv_data)

                                   MOVIES         YEAR  \
0                           Blood Red Sky       (2021)
1     Masters of the Universe: Revelation     (2021– )
2                        The Walking Dead  (2010–2022)
3                          Rick and Morty     (2013– )
4                         Army of Thieves       (2021)
...                                   ...          ...
9994                       The Imperfects     (2021– )
9995                               Arcane     (2021– )
9996                    Heart of Invictus     (2022– )
9997                       The Imperfects     (2021– )
9998                       The Imperfects     (2021– )

                                           GENRE  RATING  \
0         \nAction, Horror, Thriller                 6.1
1     \nAnimation, Action, Adventure                 5.0
2          \nDrama, Horror, Thriller                 8.2
3     \nAnimation, Adventure, Comedy                 9.2
4            \nAction, Crime, Horror                 NaN
...                                          ...     ...
9994     \nAdventure, Drama, Fantasy                 NaN
9995  \nAnimation, Action, Adventure                 NaN
9996            \nDocumentary, Sport                 NaN
9997     \nAdventure, Drama, Fantasy                 NaN
9998     \nAdventure, Drama, Fantasy                 NaN

                                               ONE-LINE  \
0     \nA woman with a mysterious illness is forced ...
1     \nThe war for Eternia begins again in what may...
2     \nSheriff Deputy Rick Grimes wakes up from a c...
3     \nAn animated series that follows the exploits...
4     \nA prequel, set before the events of Army of ...
...                                                 ...
9994                                     \nAdd a Plot\n
9995                                     \nAdd a Plot\n
9996                                     \nAdd a Plot\n
9997                                     \nAdd a Plot\n
9998                                     \nAdd a Plot\n

                                                  STARS    VOTES  RunTime  \
0     \n    Director:\nPeter Thorwarth\n| \n    Star...   21,062    121.0
1     \n            \n    Stars:\nChris Wood, \nSara...   17,870     25.0
2     \n            \n    Stars:\nAndrew Lincoln, \n...  885,805     44.0
3     \n            \n    Stars:\nJustin Roiland, \n...  414,849     23.0
4     \n    Director:\nMatthias Schweighöfer\n| \n  ...      NaN      NaN
...                                                 ...      ...      ...
9994  \n            \n    Stars:\nMorgan Taylor Camp...      NaN      NaN
9995                                                 \n      NaN      NaN
9996  \n    Director:\nOrlando von Einsiedel\n| \n  ...      NaN      NaN
9997  \n    Director:\nJovanka Vuckovic\n| \n    Sta...      NaN      NaN
9998  \n    Director:\nJovanka Vuckovic\n| \n    Sta...      NaN      NaN

     Gross
0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
...    ...
9994   NaN
9995   NaN
9996   NaN
9997   NaN
9998   NaN

[9999 rows x 9 columns]

In [13]:
# Reading an Excel file
excel_data = pd.read_excel("C:/Users/Admin/Desktop/Omdena/Tanzania_CBWP_KIC/Week 5/Resources/electricity_consumption.xlsx")

In [14]:
print(excel_data)

              timestamp region  consumption
0   2020-01-01 00:00:00  North   420.051464
1   2020-01-01 01:00:00   West   946.388751
2   2020-01-01 02:00:00  South   788.792728
3   2020-01-01 03:00:00  North   773.797258
4   2020-01-01 04:00:00   West   913.347766
..                  ...    ...          ...
495 2020-01-21 15:00:00   East   173.232639
496 2020-01-21 16:00:00   West   893.706853
497 2020-01-21 17:00:00   East   747.658142
498 2020-01-21 18:00:00  South   969.750974
499 2020-01-21 19:00:00   East   556.871993

[500 rows x 3 columns]

In [15]:
# Reading a JSON file
json_data = pd.read_json("C:/Users/Admin/Desktop/Omdena/Tanzania_CBWP_KIC/Week 5/Resource/electricity_consumption.json")

FileNotFoundError: File C:/Users/Admin/Desktop/Omdena/Tanzania_CBWP_KIC/Week 5/Resource/electricity_consumption.json does not exist

## Writing Files

In [16]:
print(df)

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

In [17]:
# write to csv 
df.to_csv("data_.csv", index = False)

In [19]:
# Write a data to exccel file
df.to_excel("data23.xlsx", index = False)

In [20]:
# Write to JSON
df.to_json("Output.json", orient="records")

# Exploring data

### Basic Information of the data

In [21]:
# Looking at the first five rows of the data - Head
df = pd.read_csv("C:/Users/Admin/Desktop/Omdena/Tanzania_CBWP_KIC/Week 5/Resources/movies.csv")

In [22]:
df.head() # Prints first five rows of the data

,MOVIES,YEAR,GENRE,RATING,ONE-LINE,STARS,VOTES,RunTime,Gross
0,Blood Red Sky,(2021),"\nAction, Horror, Thriller",6.1,\nA woman with a mysterious illness is forced ...,\n Director:\nPeter Thorwarth\n| \n Star...,"21,062",121.0,NaN
1,Masters of the Universe: Revelation,(2021– ),"\nAnimation, Action, Adventure",5.0,\nThe war for Eternia begins again in what may...,"\n \n Stars:\nChris Wood, \nSara...","17,870",25.0,NaN
2,The Walking Dead,(2010–2022),"\nDrama, Horror, Thriller",8.2,\nSheriff Deputy Rick Grimes wakes up from a c...,"\n \n Stars:\nAndrew Lincoln, \n...","885,805",44.0,NaN
3,Rick and Morty,(2013– ),"\nAnimation, Adventure, Comedy",9.2,\nAn animated series that follows the exploits...,"\n \n Stars:\nJustin Roiland, \n...","414,849",23.0,NaN
4,Army of Thieves,(2021),"\nAction, Crime, Horror",NaN,"\nA prequel, set before the events of Army of ...",\n Director:\nMatthias Schweighöfer\n| \n ...,NaN,NaN,NaN

In [23]:
# explore the last 5 rows of the 
df.tail()

,MOVIES,YEAR,GENRE,RATING,ONE-LINE,STARS,VOTES,RunTime,Gross
9994,The Imperfects,(2021– ),"\nAdventure, Drama, Fantasy",NaN,\nAdd a Plot\n,\n \n Stars:\nMorgan Taylor Camp...,NaN,NaN,NaN
9995,Arcane,(2021– ),"\nAnimation, Action, Adventure",NaN,\nAdd a Plot\n,\n,NaN,NaN,NaN
9996,Heart of Invictus,(2022– ),"\nDocumentary, Sport",NaN,\nAdd a Plot\n,\n Director:\nOrlando von Einsiedel\n| \n ...,NaN,NaN,NaN
9997,The Imperfects,(2021– ),"\nAdventure, Drama, Fantasy",NaN,\nAdd a Plot\n,\n Director:\nJovanka Vuckovic\n| \n Sta...,NaN,NaN,NaN
9998,The Imperfects,(2021– ),"\nAdventure, Drama, Fantasy",NaN,\nAdd a Plot\n,\n Director:\nJovanka Vuckovic\n| \n Sta...,NaN,NaN,NaN

In [25]:
# Geetting the summary of the data
df.info() # Information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   MOVIES    9999 non-null   object
 1   YEAR      9355 non-null   object
 2   GENRE     9919 non-null   object
 3   RATING    8179 non-null   float64
 4   ONE-LINE  9999 non-null   object
 5   STARS     9999 non-null   object
 6   VOTES     8179 non-null   object
 7   RunTime   7041 non-null   float64
 8   Gross     460 non-null    object
dtypes: float64(2), object(7)
memory usage: 703.2+ KB

In [27]:
# Getting the summary statistics
df.describe() #Describtion - summary statistics

            RATING      RunTime
count  8179.000000  7041.000000
mean      6.921176    68.688539
std       1.220232    47.258056
min       1.100000     1.000000
25%       6.200000    36.000000
50%       7.100000    60.000000
75%       7.800000    95.000000
max       9.900000   853.000000

In [28]:
# Dimension of the data
df.shape # Dimesnion - columns and rows

(9999, 9)

In [29]:
# Column names
df.columns

Index(['MOVIES', 'YEAR', 'GENRE', 'RATING', 'ONE-LINE', 'STARS', 'VOTES',
       'RunTime', 'Gross'],
      dtype='object')

In [30]:
# GEttign datatypes in my data
df.dtypes

MOVIES       object
YEAR         object
GENRE        object
RATING      float64
ONE-LINE     object
STARS        object
VOTES        object
RunTime     float64
Gross        object
dtype: object

In [31]:
# Check for missing values in the data
df.isnull().sum()

MOVIES         0
YEAR         644
GENRE         80
RATING      1820
ONE-LINE       0
STARS          0
VOTES       1820
RunTime     2958
Gross       9539
dtype: int64

In [38]:
df1

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

## Selecting data

In [39]:
df1['Name'] # Selects a single column

0      Alice
1        Bob
2    Charlie
3        Don
Name: Name, dtype: object

In [40]:
# Selcting multiple columns
df1[['Name', 'Salary']] # Selects multiple columns

      Name  Salary
0    Alice    5000
1      Bob    4000
2  Charlie    6000
3      Don    7000

In [41]:
# Selecting rows
df1.iloc[0] # First row

Name      Alice
Age          24
Salary     5000
Name: 0, dtype: object

In [42]:
# Select the first 3 rows
df1.iloc[0:3] # Select the first 3 rows

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000

In [43]:
df1

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

In [44]:
# Filter teh data based on a condition
df1.loc[df1['Age'] > 25] # Filter the rows where age is greater than 25

      Name  Age  Salary
1      Bob   30    4000
2  Charlie   26    6000

# Data Cleaning and Transformation

In [46]:
df1

      Name  Age  Salary
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

In [47]:
# Renaming a column
df1.rename(columns= {"Salary" : "Income"}, inplace = True)
df1

      Name  Age  Income
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

In [48]:
df1

      Name  Age  Income
0    Alice   24    5000
1      Bob   30    4000
2  Charlie   26    6000
3      Don   18    7000

In [51]:
df2 = df1.rename(columns={"Age" : "Year"}, inplace = False)
df2

      Name  Year  Income
0    Alice    24    5000
1      Bob    30    4000
2  Charlie    26    6000
3      Don    18    7000